---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedWood.WoodGrowthPerlinEnable
source: html/fd2057f6-3bb7-6105-7553-43579020e53f.htm
---
# Autodesk.Revit.DB.Visual.AdvancedWood.WoodGrowthPerlinEnable Property

The property labeled "Use perlin noise for ring growth" from the "AdvancedWood" schema.

## Syntax (C#)
```csharp
public static string WoodGrowthPerlinEnable { get; }
```

## Remarks
This property is of type "AssetPropertyBoolean".